jp_dict = {"宁宁": '綾地寧々',
           "爱瑠": '因幡めぐる',
           "芳乃": '朝武芳乃',
           "茉子": '常陸茉子',
           "丛雨": 'ムラサメ',
           "小春": '鞍馬小春',
           "七海": '在原七海',
           # 第二组
           "妃爱": '和泉妃愛',
           "华乃": '常盤華乃',
           "亚澄": '錦あすみ',
           "诗樱": '鎌倉詩桜',
           "天梨": '竜閑天梨',
           "里": '和泉里',
           "广梦": '新川広夢',
           "莉莉子": '聖莉々子',
           # 第三组
           "夏目": '四季ナツメ',
           "栞那": '明月栞那',
           "墨染希": '墨染希',
           "爱衣": '火打谷愛衣',
           "凉音": '汐山涼音',
           # 第四组
           "穹妹": '春日野穹',
           "目瑛": '天女目瑛',
           "奈绪": '依媛奈緒',
           "一叶": '渚一葉',
           # 第五组
           "莲华": '蓮華',
           "雾枝": '篝ノ霧枝',
           "雫": '沢渡雫',
           "亚璃子": '亜璃子',
           "椎": '灯露椎',
           "夕莉": '覡夕莉',
           # 第六组(中文)
           "小茸": '小茸',
           "唐乐吟": '唐乐吟',
           # 第七组
           "杏璃": '鷹倉杏璃',
           "杏铃": '鷹倉杏鈴',
           "明日香": '倉科明日香',
           "亚托莉": 'ATRI',
           "艾拉": 'アイラ',
           "新堂": '新堂彩音',
           "星奏": '姫野星奏',
           "结衣": '小鞠ゆい',
           "冰织": '聖代橋氷織',
           "真白": '有坂真白',
           "真红": '二階堂真紅'}


def get_speaker(name):
    return jp_dict[name] if name in jp_dict.keys() else ''


# jp_regex_29 = r"^让(杏璃|杏铃|明日香|亚托莉|艾拉|新堂|星奏|结衣|冰织|真白|真红)说(.+)$"

def get_index(name):
    if name in ['宁宁', '爱瑠', '芳乃', '茉子', '丛雨', '小春', '七海']:
        index = 1
    elif name in ['妃爱', '华乃', '亚澄', '诗樱', '天梨', '里', '广梦', '莉莉子']:
        index = 5
    elif name in ['夏目', '栞那', '墨染希', '爱衣', '凉音']:
        index = 9
    elif name in ['穹妹', '目瑛', '奈绪', '一叶']:
        index = 13
    elif name in ['莲华','雾枝','雫','亚璃子','椎','夕莉']:
        index = 17
    elif name in ['小茸','唐乐吟']:
        index = 21
    elif name in ['杏璃','杏铃','明日香','亚托莉','艾拉','新堂','星奏','结衣','冰织','真白','真红']:
        index = 29
    else:
        index = 0
    return index

